<?php

function antimat($string)

{

$w=array('СУКА','ln8.ru','ХУЙ','ХУИ','ХУЁ','ХУЕ','ИБА','ИПАЛ','АХХУЕН','АХУЕН','АХУЕННО','ПИТБ','ХУЯ','ХУУ','АХУЕ','ОХУЕ','ХУЕЛ','ОХУИ','ОХУУ','ОХИУ','ОХУЮ','АХУИ','АХИИ','АХИЕ','АХУУ','АХИУ','ПИЗД','ПИСД','ПЫЗД','ПЫСД','ПИЦД','ПЕЗД','ПЕСД','БЛЯД','БЛЯ','БЛАД','БЛЯТ','БЛАТЬ','БЛЙАД','БЛЙАТ','БЛИАД','БЛИАТ',' ЁБ',' ЁП',' ЕБ','ЙОБ','ИОБ','ЪЕБ','АЁБ','АЁП','АЕБ','АЙОБ','АИОБ','ОЁБ','ОЕБ','УЁБ','УЁП','УЕБ','УЙОБ','УИОБ','ИЕБ','ЫЕБ','МУДИ','МУДА','ЧЛЕН','ЧЛЕП','ПИДОР','ПИДАР','НИДОР','НИДАР','ПЕДИ','ЧМО','ЖОП','ДРАЧИ','ДРАЦХИ','ТВАЮ','ПОЦ','ПОХ','САСИ','СОСИ',' ЛОХ',' ЛОШ','ЕДРИ','ХЕР','ПИДО','ГОНД','МАНД','ЗАЛУП','ОТХУ','СУЧЕ','СРАН','МУДО','ДАРАС','БАЛЬНИК','СЦУКА');

$w1=array('А','Б','В','Г','Д','Е','Ё','Ж','З','И','Й','К','Л','М','Н','О','П','Р','С','Т','У','Ф','Х','Ц','Ч','Ш','Щ','Ъ','Ы','Ь','Э','Ю','Я');

$w2=array('(А|а|A|a)','(Б|б)','(В|в|B)','(Г|г|r)','(Д|д)','(Е|е|E|e)','(Е|е|E|e)','(Ж|ж)','(З|з|3)','(И|и|u)','(И|и|Й|й|u)','(К|к|K|k)','(Л|л)','(М|м|M)','(Н|н|H)','(О|о|O|o|0)','(П|п|n)','(Р|р|P|p)','(С|с|C|c|S|s)','(Т|т|T)','(У|у|Y|y)','(Ф|ф)','(Х|х|X|x)','(Ц|ц)','(Ч|ч|4)','(Ш|ш|w)','(Щ|щ|w)','(Ъ|ъ|Ь|ь|b)','(Ы|ы)','(Ь|ь|Ъ|ъ|b)','(Э|э)','(Ю|ю)','(Я|я)');

$c = sizeof($w);

for($i=0; $i<$c; $i++){

$w[$i]=str_replace($w1,$w2,$w[$i]);

$w[$i]=str_replace(')',')[^A-Za-zА-Яа-я]*',$w[$i]);

$w[$i]='~'.$w[$i].'~';

$string = preg_replace($w[$i],'***' ,$string);}

return $string;

}

?>